[
  {
    "id": "learn-phrases",
    "title": "5 Essential Phrases to Use in Moroccan Markets",
    "excerpt": "Short, practical phrases to help you bargain, ask for prices, and be polite in the souk.",
    "date": "2025-11-01",
    "category": "Travel",
    "readingTime": "3 min",
    "featured": true,
    "audioDarija": "Afak, sh7al had?",
    "content": "In the souk you'll need a few phrases to be friendly and effective. 1) Afak - please / excuse me; 2) Sh7al hada? - How much is this? ..."
  },
  {
    "id": "pronunciation-tips",
    "title": "Pronunciation Tricks for Moroccan Darija",
    "excerpt": "How to pronounce tricky consonants and use stress to sound more natural when speaking Darija.",
    "date": "2025-10-15",
    "category": "Language Tips",
    "readingTime": "5 min",
    "audioDarija": "Smaḥ liya, ma smaʿt-ksh",
    "content": "This short guide covers a few distinctive Darija sounds and tips to practice them with local speakers. Start with the emphatic consonants..."
  },
  {
    "id": "street-stories",
    "title": "Stories From Casablanca: Everyday Darija in Action",
    "excerpt": "Real conversations, where they're used, and the cultural meaning behind expressions you hear every day.",
    "date": "2025-09-28",
    "category": "Stories",
    "readingTime": "4 min",
    "audioDarija": "Aji nshufu, fin ghadi?",
    "content": "We asked locals to share short stories. In Casablanca, you will hear a mixture of modern and traditional expressions..."
  },
  {
    "id": "fast-learning",
    "title": "Tips for Learning Darija Fast (and Keeping It)",
    "excerpt": "Practical steps to memorize and practice vocabulary with locals and during travel.",
    "date": "2025-08-12",
    "category": "Tips",
    "readingTime": "3 min",
    "content": "Set a small daily goal, use spaced repetition, and practice in real contexts. The secret is consistency and friendly mistakes."
  },
  {
    "id": "travel-vocab",
    "title": "Travel Vocabulary for Morocco: Taxis, Food, and Directions",
    "excerpt": "Key words and sample sentences you’ll use while traveling in Morocco.",
    "date": "2025-07-05",
    "category": "Travel",
    "readingTime": "4 min",
    "content": "From taxi phrases to ordering tajine, here are the words you'll need to get around and enjoy local food."
  },
  {
    "id": "cultural-notes",
    "title": "Understanding Moroccan Hospitality: Cultural Notes",
    "excerpt": "Why greetings, tea, and offers of food mean more than words in Morocco.",
    "date": "2025-06-20",
    "category": "Culture",
    "readingTime": "5 min",
    "content": "Hospitality is central to Moroccan life. When someone invites you for tea, it's an expression of welcome..."
  }
]
